# Ch.4
# 4.1 파이썬 기초
# 4.1.1 Hello world

print("Hello world")

# 4.1.2 파이썬의 용도
# 파이썬은 다목적으로 사용할 수 있는 프로그래밍 언어
# 읽고 쓰기 쉽게 설계되어있음 그래서 인기 많은 언어 중 하나
# 파이썬을 사용하여 웹 어플리케이션을 제작할 수 있다
# 파이썬의 웹 애플리케이션 제작 프레임워크(프로그래밍을 쉽게 하기 위한 뼈대)로 유명한 것 : 장고, 플라스크 등

# 파이썬은 과학 기술 계산 및 데이터 분석용 언어로 유명
# 데이터 분석에 적합한 언어로는 R, MATLAB 등
# 인공지능, 머신러닝 분야에서는 파이썬이 가장 많이 사용된다

# 파이썬의 통합 개발 환경 : 파이참, 아톰, 서브라임 텍스트, 주피터 노트북 등
# 주피터 노트북은 데이터가 메모리에 유지되며 데이터 처리 로그를 노트로 남길 수 있어서 데이터 전처리에 사용된다

# 4.1.3 주석 입력
# 주석 : comment, 코드의 의도나 내용을 메모로 남길 수 있다
# 프로그램의 작동에는 아무런 영향 X
# #을 문장 앞에 붙이면 주석 작성이 된다
# #을 붙여 주석으로 만드는 것을 comment out 이라고 한다
# 여러 사람과 공동으로 개발하는 경우 주석에 코드의 의도를 표시하여 원활한 작업 진행을 가능케 한다

# 5 + 2의 결과를 출력합니다
print(5+2) # 7
# 3 + 8의 결과를 출력합니다
print(3+8) # 11

# 4.1.4 숫자와 문자열
# 숫자를 출력할 때는 큰따옴표나 작은따옴표로 묶을 필요가 없다
# ()안에 계산식을 대입하면 계산 결과가 자동으로 출력
print(3 + 6) # 9
print("8 - 3") # 8 - 3

print(18) # 18
print(2 + 6) # 8
print("2 + 6") # 2 + 6

# 4.1.5 연산자
# 파이썬에서는 기본적인 계산을 할 수 있다
# 사칙연산뿐만 아니라 지수(x^2) 등 계산과 나눗셈의 나머지 계산도 가능
# +와 - 등을 산술 연산자라고 한다

# 산술 연산자에는 덧셈, 뺄셈, 곱셈, 나눗셈, 나머지, 지수 등이 있다
# 덧셈 : +
# 뺄셈 : -
# 곱셈 : *
# 나눗셈 : /
# 나머지 : %
# 지수 : **

print(3 + 5) # 8
print(3 - 5) # -2
print(3 * 5) # 15
print(3 / 5) # 0.6
print(3 % 5) # 3
print(3**5) # 243



